Two elements were not automatically joined because other elements at join are not editable.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId OtherNonEditJoinFailure { get; }
  Visual Basic
Public Shared ReadOnly Property OtherNonEditJoinFailure As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ OtherNonEditJoinFailure {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures AutoJoinFailures Class
  Autodesk.Revit.DB Namespace